
** Script.py
#+begin_src python :results output
  import pandas as pd

  # Load the data
  health = pd.read_csv("dataR2.csv")

  print(health.head())

#+end_src

#+RESULTS:
:    Age        BMI  Glucose  ...  Resistin    MCP.1  Classification
: 0   48  23.500000       70  ...   7.99585  417.114               1
: 1   83  20.690495       92  ...   4.06405  468.786               1
: 2   82  23.124670       91  ...   9.27715  554.697               1
: 3   68  21.367521       77  ...  12.76600  928.220               1
: 4   86  21.111111       92  ...  10.57635  773.920               1
:
: [5 rows x 10 columns]

** Script.py
#+begin_src python :results output
  import pandas as pd
  from sklearn.linear_model import LogisticRegression

  # Load the data
  health = pd.read_csv("dataR2.csv")

  # Split independent and dependent variables
  X = health.iloc[:, :-1]
  y = health.iloc[:, -1]

  # Logistic regression model
  lr = LogisticRegression(max_iter=1000)

  # Fit the model
  lr.fit(X, y)

  # Print the accuracy of the model
  print(lr.score(X, y))

#+end_src

#+RESULTS:
: 0.8017241379310345

** Script.py

#+begin_src python :results output
  import pandas as pd
  from sklearn.linear_model import LogisticRegression
  from mlxtend.feature_selection import SequentialFeatureSelector as SFS
  from mlxtend.plotting import plot_sequential_feature_selection as plot_sfs
  import matplotlib.pyplot as plt

  # Load the data
  health = pd.read_csv("dataR2.csv")
  X = health.iloc[:,:-1]
  y = health.iloc[:,-1]

  # Logistic regression model
  lr = LogisticRegression(max_iter=1000)

  # Sequential forward selection
  sfs = SFS(lr,
            k_features=3,
            forward=True,
            floating=False,
            scoring='accuracy',
            cv=0)
  sfs.fit(X, y)

  # Print the chosen feature names
  print(sfs.subsets_[3]['feature_names'])

  # Print the accuracy of the model after sequential forward selection
  print(sfs.subsets_[3]['avg_score'])

  # Plot the model accuracy
  #plot_sfs(sfs.get_metric_dict())
  #plt.show()

#+end_src

#+RESULTS:
: ('Age', 'Glucose', 'Insulin')
: 0.7672413793103449

** Script.py

#+begin_src python :results output
  import pandas as pd
  from sklearn.linear_model import LogisticRegression
  from mlxtend.feature_selection import SequentialFeatureSelector as SFS
  from mlxtend.plotting import plot_sequential_feature_selection as plot_sfs
  import matplotlib.pyplot as plt

  # Load the data
  health = pd.read_csv("dataR2.csv")
  X = health.iloc[:,:-1]
  y = health.iloc[:,-1]

  # Logistic regression model
  lr = LogisticRegression(max_iter=1000)

  # Sequential backward selection
  sbs = SFS(lr,
            k_features=3,
            forward=False,
            floating=False,
            scoring='accuracy',
            cv=0)
  sbs.fit(X, y)

  # Print the chosen feature names
  print(sbs.subsets_[3]['feature_names'])

  # Print the accuracy of the model after sequential backward selection
  print(sbs.subsets_[3]['avg_score'])

  # Plot the model accuracy
  plot_sfs(sbs.get_metric_dict())
  plt.show()

#+end_src

#+RESULTS:
: ('Age', 'Glucose', 'Resistin')
: 0.7413793103448276

** Script.py

#+begin_src python :results output
  import pandas as pd
  from sklearn.linear_model import LogisticRegression
  from mlxtend.feature_selection import SequentialFeatureSelector as SFS

  # Load the data
  health = pd.read_csv("dataR2.csv")
  X = health.iloc[:,:-1]
  y = health.iloc[:,-1]

  # Logistic regression model
  lr = LogisticRegression(max_iter=1000)

  # Sequential forward floating selection
  sffs = SFS(lr,
             k_features=3,
             forward=True,
             floating=True,
             scoring='accuracy',
             cv=0)
  sffs.fit(X, y)

  # Print a tuple with the names of the features chosen by sequential forward floating selection
  print(sffs.subsets_[3]['feature_names'])

  # Sequential backward floating selection
  sbfs = SFS(lr,
            k_features=3,
            forward=False,
            floating=True,
            scoring='accuracy',
            cv=0)
  sbfs.fit(X, y)

  # Print a tuple with the names of the features chosen by sequential forward floating selection.
  print(sbfs.subsets_[3]['feature_names'])

#+end_src

#+RESULTS:
: ('Age', 'Glucose', 'Insulin')
: ('Age', 'Glucose', 'Resistin')

